## software_asset_inventory
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 17 to add, 4 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.dependencytrack_api_container_definition will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "dependencytrack_api_container_definition"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            [
              + {
                  + cpu              = 4096
                  + environment      = [
                      + {
                          + name  = "ALPINE_DATABASE_MODE"
                          + value = "external"
                        },
                      + {
                          + name  = "ALPINE_DATABASE_URL"
                          + value = "${ALPINE_DATABASE_URL}"
                        },
                      + {
                          + name  = "ALPINE_DATABASE_DRIVER"
                          + value = "org.postgresql.Driver"
                        },
                      + {
                          + name  = "ALPINE_DATABASE_DRIVER_PATH"
                          + value = "/extlib/postgresql-42.2.5.jar"
                        },
                      + {
                          + name  = "ALPINE_DATABASE_POOL_ENABLED"
                          + value = "true"
                        },
                      + {
                          + name  = "ALPINE_DATABASE_POOL_MAX_SIZE"
                          + value = "20"
                        },
                      + {
                          + name  = "ALPINE_DATABASE_POOL_MIN_IDLE"
                          + value = "10"
                        },
                      + {
                          + name  = "ALPINE_DATABASE_POOL_IDLE_TIMEOUT"
                          + value = "300000"
                        },
                      + {
                          + name  = "ALPINE_DATABASE_POOL_MAX_LIFETIME"
                          + value = "600000"
                        },
                    ]
                  + essential        = true
                  + image            = "dependencytrack/apiserver:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${AWS_LOGS_GROUP}"
                          + awslogs-region        = "${AWS_LOGS_REGION}"
                          + awslogs-stream-prefix = "${AWS_LOGS_STREAM_PREFIX}"
                        }
                    }
                  + mountPoints      = [
                      + {
                          + containerPath = "/data"
                          + readOnly      = false
                          + sourceVolume  = "${DEPENDENCYTRACK_SERVICE_NAME}"
                        },
                    ]
                  + name             = "${DEPENDENCYTRACK_SERVICE_NAME}"
                  + portMappings     = [
                      + {
                          + ContainerPort = 8080
                          + Protocol      = "tcp"
                          + hostPort      = 8080
                        },
                    ]
                  + secrets          = [
                      + {
                          + name      = "ALPINE_DATABASE_USERNAME"
                          + valueFrom = "${ALPINE_DATABASE_USERNAME}"
                        },
                      + {
                          + name      = "ALPINE_DATABASE_PASSWORD"
                          + valueFrom = "${ALPINE_DATABASE_PASSWORD}"
                        },
                    ]
                },
            ]
        )
      + vars     = {
          + "ALPINE_DATABASE_PASSWORD"     = "arn:aws:ssm:ca-central-1:794722365809:parameter/dependencytrack/dependencytrack_db_password"
          + "ALPINE_DATABASE_URL"          = (known after apply)
          + "ALPINE_DATABASE_USERNAME"     = "arn:aws:ssm:ca-central-1:794722365809:parameter/dependencytrack/dependencytrack_db_user"
          + "AWS_LOGS_GROUP"               = "/aws/ecs/dependencytrack_api"
          + "AWS_LOGS_REGION"              = "ca-central-1"
          + "AWS_LOGS_STREAM_PREFIX"       = "dependencytrack_api-task"
          + "DEPENDENCYTRACK_API_IMAGE"    = "dependencytrack/apiserver:4.4.2@sha256:584cfd2349ec93cfde2528b8f34bd5d3a9f0a393fa38806128d646743fa649ee"
          + "DEPENDENCYTRACK_SERVICE_NAME" = "dependencytrack_api"
        }
    }

  # aws_ecs_service.dependencytrack_api will be created
  + resource "aws_ecs_service" "dependencytrack_api" {
      + cluster                            = "arn:aws:ecs:ca-central-1:794722365809:cluster/software_asset_tracking"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + health_check_grace_period_seconds  = 600
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "dependencytrack_api"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "dependencytrack_api"
          + container_port   = 8080
          + target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:794722365809:targetgroup/dependencytrack-api/4b2a004160c7319f"
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = [
              + "sg-09d3c49292459a4b0",
              + "sg-0ee09476a114968fc",
            ]
          + subnets          = [
              + "subnet-0392b4da7b00295b0",
              + "subnet-089a4e6e8af85edac",
              + "subnet-0a747b55116e8c036",
            ]
        }
    }

  # aws_ecs_service.dependencytrack_frontend will be updated in-place
  ~ resource "aws_ecs_service" "dependencytrack_frontend" {
        id                                 = "arn:aws:ecs:ca-central-1:794722365809:service/software_asset_tracking/dependencytrack_frontend"
        name                               = "dependencytrack_frontend"
        tags                               = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-software-asset-inventory"
            "Terraform"  = "true"
        }
        # (15 unchanged attributes hidden)




      ~ network_configuration {
          ~ assign_public_ip = false -> true
            # (2 unchanged attributes hidden)
        }
        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.dependencytrack_api will be created
  + resource "aws_ecs_task_definition" "dependencytrack_api" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "4096"
      + execution_role_arn       = "arn:aws:iam::794722365809:role/dependencytrack_api_container_execution_role"
      + family                   = "dependencytrack_api"
      + id                       = (known after apply)
      + memory                   = "16384"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all                 = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
      + task_role_arn            = "arn:aws:iam::794722365809:role/dependencytrack_execution_role"

      + volume {
          + name = "dependencytrack_api"

          + efs_volume_configuration {
              + file_system_id     = "fs-070d3c3d42b521764"
              + root_directory     = "/"
              + transit_encryption = "ENABLED"

              + authorization_config {
                  + access_point_id = "fsap-098da7b1c87157226"
                  + iam             = "DISABLED"
                }
            }
        }
    }

  # module.dependencytrack_db.aws_db_proxy.proxy will be created
  + resource "aws_db_proxy" "proxy" {
      + arn                    = (known after apply)
      + debug_logging          = false
      + endpoint               = (known after apply)
      + engine_family          = "POSTGRESQL"
      + id                     = (known after apply)
      + idle_client_timeout    = 1800
      + name                   = "dependency-track-proxy"
      + require_tls            = true
      + role_arn               = "arn:aws:iam::794722365809:role/dependency-track_rds_proxy"
      + tags                   = {
          + "CostCentre" = "security-tools-794722365809"
          + "Name"       = "dependency-track-rds-proxy"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre" = "security-tools-794722365809"
          + "Name"       = "dependency-track-rds-proxy"
          + "Terraform"  = "true"
        }
      + vpc_security_group_ids = [
          + "sg-09d3c49292459a4b0",
        ]
      + vpc_subnet_ids         = [
          + "subnet-0392b4da7b00295b0",
          + "subnet-089a4e6e8af85edac",
          + "subnet-0a747b55116e8c036",
        ]

      + auth {
          + auth_scheme = "SECRETS"
          + description = "The database connection string"
          + iam_auth    = "DISABLED"
          + secret_arn  = "arn:aws:secretsmanager:ca-central-1:794722365809:secret:dependency-track-z970dp-R703nX"
        }
    }

  # module.dependencytrack_db.aws_db_proxy_default_target_group.this will be created
  + resource "aws_db_proxy_default_target_group" "this" {
      + arn           = (known after apply)
      + db_proxy_name = "dependency-track-proxy"
      + id            = (known after apply)
      + name          = (known after apply)

      + connection_pool_config {
          + connection_borrow_timeout    = (known after apply)
          + init_query                   = (known after apply)
          + max_connections_percent      = (known after apply)
          + max_idle_connections_percent = (known after apply)
          + session_pinning_filters      = (known after apply)
        }
    }

  # module.dependencytrack_db.aws_db_proxy_target.target will be created
  + resource "aws_db_proxy_target" "target" {
      + db_cluster_identifier = "dependency-track-cluster"
      + db_proxy_name         = "dependency-track-proxy"
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + port                  = (known after apply)
      + rds_resource_id       = (known after apply)
      + target_arn            = (known after apply)
      + target_group_name     = (known after apply)
      + tracked_cluster_id    = (known after apply)
      + type                  = (known after apply)
    }

  # module.dependencytrack_db.aws_rds_cluster_instance.instances[0] will be created
  + resource "aws_rds_cluster_instance" "instances" {
      + apply_immediately                     = (known after apply)
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + cluster_identifier                    = "dependency-track-cluster"
      + copy_tags_to_snapshot                 = false
      + db_parameter_group_name               = (known after apply)
      + db_subnet_group_name                  = "dependency-track-subnet-group"
      + dbi_resource_id                       = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "aurora-postgresql"
      + engine_version                        = "13.6"
      + engine_version_actual                 = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "dependency-track-instance-0"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.small"
      + kms_key_id                            = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + performance_insights_enabled          = true
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + preferred_backup_window               = (known after apply)
      + preferred_maintenance_window          = (known after apply)
      + promotion_tier                        = 0
      + publicly_accessible                   = false
      + storage_encrypted                     = (known after apply)
      + tags                                  = {
          + "CostCentre" = "security-tools-794722365809"
          + "Name"       = "dependency-track-instance-0"
          + "Terraform"  = "true"
        }
      + tags_all                              = {
          + "CostCentre" = "security-tools-794722365809"
          + "Name"       = "dependency-track-instance-0"
          + "Terraform"  = "true"
        }
      + writer                                = (known after apply)
    }

  # module.dependencytrack_db.aws_rds_cluster_instance.instances[1] will be created
  + resource "aws_rds_cluster_instance" "instances" {
      + apply_immediately                     = (known after apply)
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + cluster_identifier                    = "dependency-track-cluster"
      + copy_tags_to_snapshot                 = false
      + db_parameter_group_name               = (known after apply)
      + db_subnet_group_name                  = "dependency-track-subnet-group"
      + dbi_resource_id                       = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "aurora-postgresql"
      + engine_version                        = "13.6"
      + engine_version_actual                 = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "dependency-track-instance-1"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.small"
      + kms_key_id                            = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + performance_insights_enabled          = true
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + preferred_backup_window               = (known after apply)
      + preferred_maintenance_window          = (known after apply)
      + promotion_tier                        = 0
      + publicly_accessible                   = false
      + storage_encrypted                     = (known after apply)
      + tags                                  = {
          + "CostCentre" = "security-tools-794722365809"
          + "Name"       = "dependency-track-instance-1"
          + "Terraform"  = "true"
        }
      + tags_all                              = {
          + "CostCentre" = "security-tools-794722365809"
          + "Name"       = "dependency-track-instance-1"
          + "Terraform"  = "true"
        }
      + writer                                = (known after apply)
    }

  # module.dependencytrack_db.aws_secretsmanager_secret_version.proxy_connection_string will be created
  + resource "aws_secretsmanager_secret_version" "proxy_connection_string" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = "arn:aws:secretsmanager:ca-central-1:794722365809:secret:dependency-track-z970dp-proxy-connection-string-AM3RwO"
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # module.vpc.aws_default_network_acl.default will be updated in-place
  ~ resource "aws_default_network_acl" "default" {
        id                     = "acl-09799e19810a3fec8"
      ~ subnet_ids             = [
          - "subnet-0392b4da7b00295b0",
          - "subnet-089a4e6e8af85edac",
          - "subnet-0a747b55116e8c036",
          - "subnet-0af32161dbb356f09",
          - "subnet-0bcd1d14db3a0100e",
        ]
        tags                   = {
            "CostCentre" = "security-tools-794722365809"
            "Name"       = "security-tools-software-asset-inventory_default_nacl"
            "Terraform"  = "true"
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_eip.nat[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_eip" "nat" {
      - allocation_id        = "eipalloc-0ec1a1c398838e4d8" -> null
      - domain               = "vpc" -> null
      - id                   = "eipalloc-0ec1a1c398838e4d8" -> null
      - network_border_group = "ca-central-1" -> null
      - private_dns          = "ip-10-0-12-31.ca-central-1.compute.internal" -> null
      - public_dns           = "ec2-3-97-252-248.ca-central-1.compute.amazonaws.com" -> null
      - public_ip            = "3.97.252.248" -> null
      - public_ipv4_pool     = "amazon" -> null
      - tags                 = {
          - "CostCentre" = "security-tools-794722365809"
          - "Name"       = "security-tools-software-asset-inventory-eip0"
          - "Terraform"  = "true"
        } -> null
      - tags_all             = {
          - "CostCentre" = "security-tools-794722365809"
          - "Name"       = "security-tools-software-asset-inventory-eip0"
          - "Terraform"  = "true"
        } -> null
      - vpc                  = true -> null
    }

  # module.vpc.aws_nat_gateway.nat_gw[0] will be created
  + resource "aws_nat_gateway" "nat_gw" {
      + connectivity_type    = "private"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = "subnet-0af32161dbb356f09"
      + tags                 = {
          + "CostCentre" = "security-tools-794722365809"
          + "Name"       = "security-tools-software-asset-inventory-natgw-0"
          + "Terraform"  = "true"
        }
      + tags_all             = {
          + "CostCentre" = "security-tools-794722365809"
          + "Name"       = "security-tools-software-asset-inventory-natgw-0"
          + "Terraform"  = "true"
        }
    }

  # module.vpc.aws_nat_gateway.nat_gw[1] will be created
  + resource "aws_nat_gateway" "nat_gw" {
      + connectivity_type    = "private"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "CostCentre" = "security-tools-794722365809"
          + "Name"       = "security-tools-software-asset-inventory-natgw-1"
          + "Terraform"  = "true"
        }
      + tags_all             = {
          + "CostCentre" = "security-tools-794722365809"
          + "Name"       = "security-tools-software-asset-inventory-natgw-1"
          + "Terraform"  = "true"
        }
    }

  # module.vpc.aws_nat_gateway.nat_gw[2] will be created
  + resource "aws_nat_gateway" "nat_gw" {
      + connectivity_type    = "private"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = "subnet-0bcd1d14db3a0100e"
      + tags                 = {
          + "CostCentre" = "security-tools-794722365809"
          + "Name"       = "security-tools-software-asset-inventory-natgw-2"
          + "Terraform"  = "true"
        }
      + tags_all             = {
          + "CostCentre" = "security-tools-794722365809"
          + "Name"       = "security-tools-software-asset-inventory-natgw-2"
          + "Terraform"  = "true"
        }
    }

  # module.vpc.aws_network_acl.main will be updated in-place
  ~ resource "aws_network_acl" "main" {
        id         = "acl-0b2e5f2568a76a36a"
      ~ subnet_ids = [] -> (known after apply)
        tags       = {
            "CostCentre" = "security-tools-794722365809"
            "Name"       = "security-tools-software-asset-inventory_main_nacl"
            "Terraform"  = "true"
        }
        # (6 unchanged attributes hidden)
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be updated in-place
  ~ resource "aws_route" "private_nat_gateway" {
        id                     = "r-rtb-0ecc9cd6b4f9d7e3d1080289494"
      ~ nat_gateway_id         = "nat-009631b54533d2ecf" -> (known after apply)
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_route.private_nat_gateway[1] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-0890b8238bb1b08d2"
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[2] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-0ce5cf50974329d22"
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = "rtb-02622707784b1e6a9"
      + subnet_id      = "subnet-0af32161dbb356f09"
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = "rtb-02622707784b1e6a9"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = "rtb-02622707784b1e6a9"
      + subnet_id      = "subnet-0bcd1d14db3a0100e"
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ca-central-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.12.32/27"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "CostCentre" = "security-tools-794722365809"
          + "Name"       = "security-tools-software-asset-inventory_public_subnet_ca-central-1b"
          + "Terraform"  = "true"
          + "Tier"       = "Public"
        }
      + tags_all                                       = {
          + "CostCentre" = "security-tools-794722365809"
          + "Name"       = "security-tools-software-asset-inventory_public_subnet_ca-central-1b"
          + "Terraform"  = "true"
          + "Tier"       = "Public"
        }
      + vpc_id                                         = "vpc-024dad03bd44299d3"
    }

Plan: 17 to add, 4 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
